[{"title": "NASA to Hold Mars 2020 Perseverance Rover Launch Briefing", "preview": "Learn more about the agency's next Red Planet mission during a live event on June 17."}, {"title": "NASA's MAVEN Maps Winds in the Martian Upper Atmosphere that Mirror the Terrain Below and Gives Clues to Martian Climate", "preview": "Researchers have created the first map of wind circulation in the upper atmosphere of a planet besides Earth, using data from NASA’s MAVEN spacecraft that were collected during the last two years."}, {"title": "NASA Invites Public to Share Excitement of Mars 2020 Perseverance Rover Launch", "preview": "There are lots of ways to participate in the historic event, which is targeted for July 30."}, {"title": "Global Storms on Mars Launch Dust Towers Into the Sky", "preview": "A Mars Dust Tower Stands Out Dust storms are common on Mars. But every decade or so, something unpredictable happens: a series of runaway storms break out, covering the entire planet in a dusty haze."}, {"title": "NASA's Perseverance Rover Goes Through Trials by Fire, Ice, Light and Sound", "preview": "The agency's new Mars rover is put through a series of tests in vacuum chambers, acoustic chambers and more to get ready for the Red Planet."}, {"title": "7 Things to Know About the Mars 2020 Perseverance Rover Mission", "preview": "NASA's next rover to the Red Planet is slated to launch no earlier than July 30. These highlights will get you up to speed on the ambitious mission."}, {"title": "The Extraordinary Sample-Gathering System of NASA's Perseverance Mars Rover", "preview": "Two astronauts collected Moon rocks on Apollo 11. It will take three robotic systems working together to gather up the first Mars rock samples for return to Earth."}, {"title": "Alabama High School Student Names NASA's Mars Helicopter", "preview": "Vaneeza Rupani's essay was chosen as the name for the small spacecraft, which will mark NASA's first attempt at powered flight on another planet."}, {"title": "NASA's Perseverance Rover 100 Days Out", "preview": "Mark your calendars: The agency's latest rover has only about 8,640,000 seconds to go before it touches down on the Red Planet, becoming history's next Mars car."}, {"title": "NASA's Perseverance Rover Will Look at Mars Through These 'Eyes'", "preview": "A pair of zoomable cameras will help scientists and rover drivers with high-resolution color images."}, {"title": "Two Rovers to Roll on Mars Again: Curiosity and Mars 2020", "preview": "They look like twins. But under the hood, the rover currently exploring the Red Planet and the one launching there this summer have distinct science tools and roles to play."}, {"title": "The Launch Is Approaching for NASA's Next Mars Rover, Perseverance", "preview": "The Red Planet's surface has been visited by eight NASA spacecraft. The ninth will be the first that includes a roundtrip ticket in its flight plan."}, {"title": "NASA's Ingenuity Mars Helicopter Recharges Its Batteries in Flight", "preview": "Headed to the Red Planet with the Perseverance rover, the pioneering helicopter is powered up for the first time in interplanetary space as part of a systems check."}, {"title": "Mars Is Getting a New Robotic Meteorologist", "preview": "Sensors on NASA's Perseverance will help prepare for future human exploration by taking weather measurements and studying dust particles."}, {"title": "The MarCO Mission Comes to an End", "preview": "The pair of briefcase-sized satellites made history when they sailed past Mars in 2019."}]